apps/server/tests/load/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
  processor: "./processor.js"
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  # API Health Check
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # User Authentication
  - name: "User Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser{{ $randomNumber() }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

  # Get User Profile
  - name: "Get Profile"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Get Chats List
  - name: "Get Chats"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/chats"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Send Message
  - name: "Send Message"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/messages"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            chatId: "{{ $randomString() }}"
            text: "Load test message {{ $randomNumber() }}"
          expect:
            - statusCode: [200, 201, 400, 404]

  # Search Users
  - name: "Search Users"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/users/search?q=test"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Get Stories
  - name: "Get Stories"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/stories"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Get Statistics
  - name: "Get Statistics"
    weight: 5
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/utilities/statistics"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200